root-2.3.0/run/tutorials/combustion/fireFoam/les/oppositeBurningPanels/0/muSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      muSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ground
    {
        type            fixedValue;
        value           uniform 0;
    }

    top
    {
        type            zeroGradient;
    }

    burner
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;
    }

    "(region0_to.*)"
    {
        type            mutUSpaldingWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
